
/*3.	Комбинации
Напишете програма, която изчислява колко решения в естествените числа 
(включително и нулата) има уравнението:
x1 + x2 + x3 = n
Числото n е цяло число и се въвежда от конзолата. 
Примерен вход и изход
Вход	Изход	Обяснения	Вход	Изход	Вход	Изход
25	351	Генерираме всички комбинации от 3 числа, като първата е:
0+0+0=0, но понеже не е равна на 25, продължаваме:
0+0+1=1 – също не е 25 и т.н.
Стигаме до първата валидна комбинация:
0 + 0 + 25 = 25, увеличаваме броя на валидни комбинации с 1,втората валидна комбинация е:
0 + 1 + 24 = 25
Третата:
0 + 2 + 23 = 25  и т.н.
След генериране на всички възможни комбинации, броят на валидните е 351.	20	231	5
	21
 * */
import java.util.Scanner;
public class Combinations03 {
	public static void main(String[] args) {	
		Scanner scanner = new Scanner(System.in);
		int number = Integer.parseInt(scanner.nextLine());
		int countNumber=0;
		for (int i = 0; i <= number; i++) {	
			for (int j = 0; j <= number; j++) {
				for (int h = 0; h <= number; h++) {
					if (h+j+i==number) {
						countNumber+=1;
					}	
				}
			}
		}
		System.out.println(countNumber);
	}
}
